{
  "sections": [
    {
      "id": "story:kl82",
      "start_date": "2009",
      "end_date": "2011", 
      "title": "Full-Stack Foundations at KL82 (Creative Laboratory 82)",
      "content": "I began my career in 2009 at KL82, a boutique digital studio in Minsk, where I worked as a full-stack engineer delivering commercial web products end-to-end. Over two years, I shipped 20+ e-commerce websites, owning frontend interfaces, PHP/MySQL backends, server configuration, and deployment.<br/><br/>Although the technology stack was foundational — PHP, MySQL, JavaScript, HTML, CSS2, Apache — the work required solving real engineering problems: implementing custom designs without modern CSS tooling, building reusable UI components, and supporting highly interactive marketing experiences. I also integrated and extended platforms such as WordPress, Joomla, and Drupal, and built interactive Flash applications using ActionScript for campaign-driven projects.<br/><br/>To reduce delivery friction, I helped evolve and maintain an internal CMS used across client projects, extending its functionality and adapting it to diverse business needs. These years established my habit of treating systems holistically — from interface to infrastructure — and building software that was both fast to ship and maintainable over time."
    },
    {
      "id": "story:sophia",
      "start_date": "2011",
      "end_date": "2013", 
      "title": "Scalable Frontend Systems at Sophia Learning (via Warecorp)",
      "content": "In 2011, I joined Warecorp to work on Sophia Learning, an education platform based in Minneapolis with engineering and product teams in Minsk. As part of a ~25-person cross-functional team, I contributed to building an online learning system enabling students to earn transferable college-level credits.<br/><br/>Within a small frontend group, I focused on architecting modular, interactive JavaScript interfaces layered on top of a Ruby on Rails backend. At a time when responsive design was still emerging, we made it a foundational standard. Accessibility was treated with equal rigor — the platform underwent formal audits and achieved ADA compliance certification, shaping my long-term approach to inclusive, standards-driven UI development.<br/><br/>This role marked a significant step forward in managing frontend complexity at scale — structuring large jQuery-based codebases, collaborating deeply with backend and product teams, and delivering high-traffic interfaces with performance, accessibility, and usability as first-class concerns."
    },
    {
      "id": "story:candena",
      "start_date": "2013",
      "end_date": "2015",
      "title": "Frontend Ownership & Platform Evolution at Candena",
      "content": "In 2013, I joined Candena, a Berlin-based B2B EdTech company delivering online training platforms for enterprises and universities, including organizations such as T-Mobile and German academic institutions.<br/><br/>Working remotely as the sole frontend engineer within a lean engineering team, I was responsible for architecting a fully customizable, themeable platform that supported diverse branding and configuration requirements across clients. The system enabled complex, multi-stage learning programs with mentors, assignments, and team-based evaluation over extended timelines. I also led the frontend modernization strategy, defining migration phases and engineering priorities while continuing to deliver features in the legacy system.<br/><br/>With limited resources and no dedicated design function, I led many interface and UX decisions — defining layout systems, UI behaviors, and configuration layers to support reuse without sacrificing flexibility. I introduced structural conventions such as BEM and emphasized modularity to keep the platform adaptable as customer requirements evolved.<br/><br/>As the company grew and React adoption increased, I transitioned into a formal technical leadership role — leading the migration from a multi-page Rails application to a React-based single-page architecture. I set frontend direction, established coding standards, mentored incoming engineers, and documented the new system to ensure long-term maintainability. As the team expanded, I helped hire and onboard frontend engineers, introduced CI pipelines, and established delivery workflows to support a distributed team.<br/><br/>This experience strengthened my skills in technical leadership, product-driven architecture, and system modernization — designing for long-term scalability while shipping continuous improvements in parallel."
    },
    {
      "id": "story:move-to-us",
      "start_date": "2015",
      "end_date": "2017",
      "title": "U.S. Transition & Freelance Exploration",
      "content": "In 2015, I relocated to the United States and took a deliberate pause from full-time roles to focus on English fluency, cultural adaptation, and professional recalibration.<br/><br/>During this period, I worked as a freelancer with early-stage startups, primarily using Angular and Vue, helping teams ship MVPs under tight constraints. These short-cycle engagements strengthened my ability to translate ambiguous product needs into pragmatic technical solutions and refine delivery strategies — skills that later became central to my leadership approach."
    },
    {
      "id": "story:amelia",
      "start_date": "2017",
      "end_date": "2018",
      "title": "Conversational AI Interfaces at Amelia (IPsoft)",
      "content": "In 2017, I joined IPsoft (later rebranded as Amelia) to work on enterprise conversational AI products. As part of the frontend/UI engineering group, I built React-based interfaces for configuring complex dialog flows used by non-technical users.<br/><br/>Although the UI itself was not graphically heavy, the underlying data model was highly complex — requiring close collaboration with Cognitive Engineers who designed conversation logic using BPMN-like systems. I developed embeddable, accessible interfaces with full keyboard and assistive-technology support, deployed across browsers, mobile devices, and touch-based installations.<br/><br/>Beyond core product development, I supported customization, branding, and deployment for enterprise clients — helping Amelia evolve from a niche conversational UI into a highly configurable AI platform adopted by 20+ large organizations. This role marked a key transition in my career, moving from advanced frontend engineering into AI-driven product development at enterprise scale."
    },
    {
      "id": "story:namely",
      "start_date": "2018",
      "end_date": "2020",
      "title": "Design Systems & Full-Stack Delivery at Namely",
      "content": "In 2018, I joined Namely, a fast-growing HR and payroll platform, initially as a Senior Frontend Engineer. I was embedded in a newly formed Integration team building a greenfield product focused on employee data imports, where I led frontend planning, implementation, and release coordination.<br/><br/>Although engineers were distributed across multiple product teams, frontend development operated as a centralized discipline, aligned on shared architecture and tooling. As part of this group, I contributed to evolving the internal design system, supporting adoption across teams and improving UI consistency at scale.<br/><br/>After one year, I transitioned into a full-stack role, contributing to Go-based APIs while continuing to mentor engineers, improve frontend tooling, and guide delivery workflows. Later, I supported the Benefits team — a domain requiring interfaces capable of transforming and validating large, multi-source datasets. This period significantly broadened my backend exposure while reinforcing my ability to scale systems and collaboration in high-velocity environments."
    },
    {
      "id": "story:wetransfer",
      "start_date": "2020",
      "end_date": "2024",
      "title": "Product & Platform Architecture at WeTransfer",
      "content": "I joined WeTransfer in 2020, spending four years there as both a Senior Full-Stack Engineer and later a Staff Frontend Engineer, contributing to products used by 1M+ daily users.<br/><br/>I began on the Paste team, building a visually rich, real-time collaborative product for creating and sharing presentations. I owned feature development end-to-end — from design review to implementation — with particular focus on animation quality, interaction smoothness, and frontend performance. I also led efforts to modernize legacy React code, defining frontend principles and introducing a progressive refactoring strategy to improve maintainability at scale.<br/><br/>In 2022, I became the founding frontend engineer on the App Platform team, created to unify frontend architecture across five distinct products. Partnering with engineering management, backend architecture, and product leadership, I led the design and implementation of a multi-package design system (@wetransfer-ux), spanning tokens, utilities, components, and shared modules. The system was adopted across high-traffic applications and contributed to a ~30% improvement in delivery speed by reducing duplication and standardizing practices.<br/><br/>I authored internal documentation, defined contribution workflows, supported hiring and interviews, and helped scale the team from 4 to 10 engineers within six months. In late 2024, WeTransfer was acquired by Bending Spoons, and the U.S. team was laid off as part of the transition."
    },
    {
      "id": "story:wowcube",
      "start_date": "2025",
      "end_date": "Present",
      "title": "Technical Leadership at WoWCube",
      "content": "In May 2025, I joined WoWCube as an Engineering Manager, taking ownership of technical planning, scope definition, delivery timelines, and quality standards. I work closely with product leadership to balance velocity and long-term maintainability, making time-sensitive trade-offs while keeping systems scalable and coherent.<br/><br/>Alongside management responsibilities, I remain hands-on — contributing to isolated modules, reviewing pull requests, guiding architectural decisions, and unblocking engineers through direct technical involvement. My focus is on building a high-ownership engineering culture where product goals and technical execution remain tightly aligned.<br/><br/>This role represents a natural evolution of my career — combining deep hands-on experience with platform-level thinking, cross-functional leadership, and long-term system stewardship."
    }
  ]
}

