{
  "name": "Yulia Kanapatskaya",
  "links": {
    "linkedin": "https://linkedin.com/in/yskaya",
    "email": "yulia.kanapatskaya@gmail.com",
    "github": "https://github.com/yskaya",
    "website": "yulia.kanapatskaya.me",
    "personal_websites": [
      "https://amelia.ai",
      "https://wetransfer.com",
      "https://www.sophia.org",
      "https://www.namely.com/",
      "https://www.sophia.org/"
    ]
  },
  "positions": [
    "Staff+ Frontend / Platform Engineer",
    "Engineering Manager (Technical)",
    "Senior Full-Stack / Frontend Engineer",
    "Individual Contriputer /  Principled Engineer"
  ],
  "location": "Los Angeles - open for relocation",
  "short_description": "I design scalable frontend platforms, design systems, and modern web architectures — blending hands-on engineering with long-term technical leadership.",
  "about": "Frontend platform & system architect with 15+ years of experience leading UI infrastructure and full-stack systems in high-scale, multi-product environments. Specialized in design systems, frontend platforms, and modernizing legacy systems into scalable architectures. Strong at translating product vision into executable technical plans while balancing delivery, quality, and long-term maintainability. Core Technologies: React, TypeScript, Next.js, Node.js, NestJS, GraphQL, Redis, gRPC, Docker, AWS.",
  "about_section": {
    "title": "Overview",
    "highlights": [
      {
        "icon": "Code2",
        "title": "15+ Years",
        "desc": "Building and scaling production web systems"
      },
      {
        "icon": "Globe",
        "title": "Scope",
        "desc": "Frontend platforms & full-stack architecture"
      },
      {
        "icon": "Users",
        "title": "Leadership",
        "desc": "Staff-level, hands-on technical ownership"
      },
      {
        "icon": "Award",
        "title": "Impact",
        "desc": "Systems used by teams and millions of users"
      }
    ],
    "content": [
      {
        "content": "I'm a <strong>Staff-level frontend and full-stack engineer</strong> with <strong>15+ years of experience</strong> building and scaling web products across startups and large consumer platforms. My core strength is <strong>technical leadership as an individual contributor</strong> — designing frontend platforms, shared systems, and scalable architectures while staying deeply involved in implementation. I've worked across high-impact product teams in the <strong>U.S. and Europe</strong>, contributing to systems used by <strong>millions of users</strong>."
      },
      {
        "content": "At <strong>WeTransfer</strong>, I led frontend platform architecture, including a <strong>multi-package design system</strong> adopted across five products and used by <strong>30+ engineers</strong>, supporting applications with <strong>1M+ DAU</strong>. I remained hands-on through code contributions, pull request reviews, and architectural guidance, while partnering closely with product and platform teams. More recently, I stepped into a <strong>Technical Engineering Manager</strong> role, expanding my scope into planning, prioritization, and delivery — while continuing to contribute directly to the codebase."
      },
      {
        "content": "My priority is a <strong>Principal or Staff IC role</strong> with a frontend focus, where <strong>architectural ownership</strong> and <strong>hands-on execution</strong> are central. I'm also open to <strong>technical engineering management roles</strong> where leadership remains close to the work — combining system design, delivery ownership, and active engineering involvement. I'm looking for a <strong>long-term environment</strong> that values clarity, sustainable systems, and leadership through impact."
      }
    ]
  },
  "education": {
    "degree": "Master of Science in Computer Systems Engineering",
    "university": "Belarusian State University of Informatics and Radio-electronics",
    "location": "Minsk, Belarus",
    "start": "Sep 2005",
    "end": "Sep 2010"
  },
  "career_highlights": {
    "years_experience": "15+",
    "countries_worked": "5",
    "projects_delivered": "20+",
    "users_impacted": "Millions"
  }
}
