{
  "name": "Yulia Kanapatskaya",
  "links": {
    "linkedin": "https://linkedin.com/in/yskaya",
    "email": "yulia.kanapatskaya@gmail.com",
    "github": "https://github.com/yskaya",
    "website": "kanapatskaya.me",
    "personal_websites": [
      "https://amelia.ai",
      "https://wetransfer.com",
      "https://aparti.ai",
      "https://www.namely.com/",
      "https://www.sophia.org/"
    ]
  },
  "positions": [
    "Staff / Principal Frontend Engineer",
    "Platform & Product Architecture",
    "Individual Contributor (IC)"
  ],
  "location": "Los Angeles",
  "open_for_relocation": true,
  "short_description": "15+ years delivering large-scale web platforms, with end-to-end ownership across frontend systems, full-stack execution, and technical leadership supporting products used by millions worldwide",
  "about": "Frontend platform & system architect with 15+ years of experience leading UI infrastructure and full-stack systems in high-scale, multi-product environments. Specialized in design systems, frontend platforms, and modernizing legacy systems into scalable architectures. Strong at translating product vision into executable technical plans while balancing delivery, quality, and long-term maintainability. Core Technologies: React, TypeScript, Next.js, Node.js, NestJS, GraphQL, Redis, gRPC, Docker, AWS.",
  "about_section": {
    "title": "Overview",
    "highlights": [
      {
        "icon": "Code2",
        "title": "15+ Years of Experience",
        "desc": "Building and scaling production web systems"
      },
      {
        "icon": "Globe",
        "title": "Scope",
        "desc": "Frontend platforms & full-stack architecture"
      },
      {
        "icon": "Users",
        "title": "Leadership",
        "desc": "Staff-level, hands-on technical ownership"
      },
      {
        "icon": "Award",
        "title": "Impact",
        "desc": "Systems used by teams and millions of users"
      }
    ],
    "content": [
      {
        "content": "I’m a Staff / Principal-level frontend and full-stack engineer with 15+ years of experience building and scaling web products across startups and large consumer platforms."
      },
      {
        "content": "My core strength is technical leadership as an individual contributor — designing frontend platforms, shared systems, and scalable architectures while staying deeply hands-on in implementation. I work at the intersection of product, architecture, and execution, often owning complex technical problems end-to-end and partnering closely with product and design to shape solutions early."
      },
      {
        "content": "I’ve led frontend platform initiatives, design systems, and cross-product architecture used by millions of users, while remaining actively involved in code, reviews, and system design."
      }
    ]
  },
  "qualification_section": {
    "title": "Qualifications",
    "highlights": [
      {
        "icon": "Code2",
        "title": "Frontend Expert",
        "desc": "Scalable platforms & shared UI systems"
      },
      {
        "icon": "Users",
        "title": "Technical Leadership",
        "desc": "Architecture, delivery & system evolution"
      },
      {
        "icon": "Globe",
        "title": "Full-Stack",
        "desc": "Frontend-first with backend contributions"
      },
      {
        "icon": "Award",
        "title": "Modernization",
        "desc": "Leading legacy codebase transformations"
      }
    ],
    "content": [
      {
        "content": "Frontend expert specializing in scalable platforms, shared UI systems, and design systems"
      },
      {
        "content": "Technical leadership across architecture, delivery, and long-term system evolution"
      },
      {
        "content": "Hands-on full-stack engineer (frontend-first, with active backend contributions)"
      },
      {
        "content": "Experience leading modernization efforts across complex, legacy codebases"
      },
      {
        "content": "Growing focus on technical management while remaining close to the code"
      }
    ]
  },
  "education": {
    "degree": "Master of Science in Computer Systems Engineering",
    "university": "Belarusian State University of Informatics and Radio-electronics",
    "location": "Minsk, Belarus",
    "start_date": "Sep 2005",
    "end_date": "Sep 2010"
  },
  "career_highlights": {
    "years_experience": "15+",
    "countries_worked": "5",
    "projects_delivered": "20+",
    "users_impacted": "Millions"
  },
  "contact_text": "I'm currently considering Senior, Staff, or Principal IC roles where I can stay hands-on as a full-stack engineer with deep React expertise, while continuing to grow in architectural ownership, product influence, and technical leadership as an individual contributor."
}
