{
  "projects": [
    {
      "id": 1,
      "name": "WeTransfer Platform",
      "short_descr": "Global consumer and B2B platform delivering large-scale file sharing and creative collaboration products used by millions of users worldwide.",
      "long_descr": [
        {
          "content": "WeTransfer is a global technology company best known for its file-sharing platform, serving millions of individual users and creative teams worldwide. Beyond simple file transfer, the company evolved into a multi-product ecosystem focused on creative productivity, collaboration, and content sharing, operating at significant consumer scale with strong emphasis on design quality and performance. During my tenure, WeTransfer supported 1M+ daily active users, with products spanning consumer-facing experiences and internal platform infrastructure shared across teams."
        },
        {
          "title": "Responsibilities",
          "content": "• Led frontend platform architecture, including a multi-package design system and shared UI foundations<br/>• Designed and implemented CI/CD pipelines, build systems, and publishing workflows<br/>• Partnered with product, design, and engineering leadership to translate product vision into cross-team execution<br/>• Modernized frontend architecture to improve performance, maintainability, and scalability<br/>• Built and evolved complex real-time collaborative editing features<br/>• Owned end-to-end feature delivery from scoping through release<br/>• Improved interactive user experience for simultaneous editing"
        }
      ],
      "links": {
        "live": "https://wetransfer.com",
        "github": ""
      },
      "tech_stack": ["TypeScript", "React", "Node.js", "Next.js", "NestJS", "GraphQL", "Redis", "Monorepo", "Microservices"],
      "role": ["Staff Frontend Engineer", "Senior Software Engineer"],
      "date": "Sep 2020 - Sep 2024",
      "location": "NYC (remote)",
      "team_size": ["Paste (~15 engineers)", "App Platform team (scaled from 4 to 10 engineers)", "30+ engineers using design system"],
      "company": "WeTransfer",
      "company_size": "200+ employees",
      "image": "/images/wetransfer-project.jpg",
      "achievements": [
        "Architected multi-package design system adopted by 30+ engineers across 5 products with 1M+ DAU",
        "Founded frontend engineering on App Platform team, unifying frontend architecture org-wide",
        "Contributed to ~30% improvement in delivery speed by reducing duplication and standardizing practices",
        "Established CI/CD pipelines, publishing workflows, and architecture documentation"
      ]
    },
    {
      "id": 2,
      "name": "Namely HR Platform",
      "short_descr": "B2B HR, payroll, and benefits platform enabling mid-sized companies to manage employee data, compliance, and complex operational workflows.",
      "long_descr": [
        {
          "content": "Namely is a U.S.-based HR technology company providing an integrated platform for human resources, payroll, benefits administration, and compliance. The product serves mid-sized organizations with diverse workforce structures, requiring systems that can handle complex data models, regulatory constraints, and high expectations for accuracy and reliability. The platform operates in a data-intensive, high-stakes domain where frontend systems must support multi-step workflows, validation-heavy processes, and clear error handling for non-technical business users."
        },
        {
          "title": "Responsibilities",
          "content": "• Contributed to Go-based REST APIs<br/>• Owned integration tool end-to-end from UX to API delivery<br/>• Mentored engineers through code reviews, POCs, and design docs<br/>• Scaled HR platform capabilities through new tools and product integrations<br/>• Owned product-critical modules with focus on performance and scalability<br/>• Built and documented a shared design system<br/>• Delivered React-based UIs for complex HR and payroll onboarding workflows"
        }
      ],
      "links": {
        "live": "https://www.namely.com/",
        "github": ""
      },
      "tech_stack": ["JavaScript", "TypeScript", "React", "Redux", "GraphQL", "Go", "Node.js", "Redis", "gRPC", "SCSS"],
      "role": "Senior Full-Stack / Frontend Engineer",
      "date": "Sep 2018 - Sep 2020",
      "location": "NYC (hybrid)",
      "team_size": "Integration team, later Benefits team",
      "company": "Namely",
      "company_size": "300+ employees",
      "image": "/images/namely-project.jpg",
      "achievements": [
        "Built complex HR & payroll UIs integrating React frontends with Go-based APIs",
        "Led frontend architecture for data-heavy workflows and validation tools",
        "Contributed to and scaled internal design system adopted across teams"
      ]
    },
    {
      "id": 3,
      "name": "Amelia AI Platform",
      "short_descr": "Enterprise conversational AI platform enabling organizations to automate customer and employee interactions across text and voice channels.",
      "long_descr": [
        {
          "content": "Amelia (formerly IPsoft) is an enterprise AI company focused on intelligent automation and conversational AI solutions for large organizations. The platform enables businesses to deploy virtual assistants across customer service, HR, IT support, and internal operations, integrating with existing enterprise systems and workflows. During this period, Amelia was evolving from early chatbot-style deployments into a highly configurable, enterprise-grade AI platform, supporting complex dialog logic, multi-channel delivery, and strict accessibility and usability requirements."
        },
        {
          "title": "Responsibilities",
          "content": "• Built React-based conversational UI for enterprise customers<br/>• Collaborated with Cognitive Engineers to design dialog configuration workflows<br/>• Developed frontend architecture supporting branding and multi-tenant deployments<br/>• Designed reusable UI components and interaction patterns for enterprise environments<br/>• Ensured accessibility (keyboard navigation, assistive technologies)<br/>• Made systems embeddable across customer platforms and customizable for branding"
        }
      ],
      "links": {
        "live": "https://amelia.ai",
        "github": ""
      },
      "tech_stack": ["React", "Redux", "JavaScript", "SCSS", "CSS", "HTML", "JSX", "ES6", "BPM/BPMN"],
      "role": "AI Software Engineer",
      "date": "Sep 2017 - Sep 2018",
      "location": "NYC (on-site)",
      "team_size": "Frontend/UI engineering group",
      "company": "IPsoft (Amelia)",
      "company_size": "500+ employees",
      "image": "/images/amelia-ai-project.jpg",
      "achievements": [
        "Built React-based conversational UI used by 20+ enterprise clients",
        "Developed BPMN-style visual configuration tools for dialog workflows",
        "Helped evolve Amelia from niche conversational UI into highly configurable AI platform"
      ]
    },
    {
      "id": 4,
      "name": "Candena Training Platform",
      "short_descr": "B2B EdTech platform delivering customizable online training systems for enterprises and universities, with white-label theming and modular learning workflows.",
      "long_descr": [
        {
          "content": "Candena was a Berlin-based EdTech SaaS company building scalable online learning platforms for enterprises and academic institutions. The product supported long-running, mentor-led learning programs with assignments, evaluations, and team-based collaboration, requiring flexible configuration and strong support for client-specific branding. The platform served multiple organizations with distinct requirements, making reusability, configurability, and maintainability core product concerns from an early stage."
        },
        {
          "title": "Responsibilities",
          "content": "• Led frontend modernization of a legacy Rails application<br/>• Delivered modular SPA frontends while maintaining the legacy system<br/>• Introduced greenfield React application for new workflows<br/>• Established frontend standards, CI pipelines, and workflows<br/>• Acted as technical lead supporting hiring, onboarding, and planning<br/>• Designed configurable UI layers to support multi-brand deployments<br/>• Defined layout systems and interaction patterns reusable across clients<br/>• Balanced customization needs with long-term maintainability"
        }
      ],
      "links": {
        "live": "https://www.sophia.org",
        "github": ""
      },
      "tech_stack": ["React", "Ruby on Rails", "JavaScript", "SCSS", "CSS", "HTML", "BEM"],
      "role": "Founding Engineer / Technical Lead (Frontend)",
      "date": "Dec 2013 - Dec 2015",
      "location": "Berlin (remote)",
      "team_size": "5-person team",
      "company": "Candena",
      "company_size": "10-15 employees",
      "image": "/images/candena-project.jpg",
      "achievements": [
        "Re-architected legacy Rails monolith into modular React SPA",
        "Delivered themeable UI framework reused by 20+ enterprise and university deployments",
        "Led 5-person team and introduced CI pipelines, coding standards, and release workflows"
      ]
    },
    {
      "id": 5,
      "name": "Sophia Learning Platform",
      "short_descr": "Online education platform delivering scalable, credit-eligible courses with accessible, responsive learning experiences for a broad student audience.",
      "long_descr": [
        {
          "content": "Sophia Learning is an online education platform offering self-paced, college-level courses designed to be affordable, accessible, and transferable through partnerships with higher-education institutions. The product serves a large and diverse student base, requiring reliable performance, strong accessibility standards, and responsive design across devices. During this period, Sophia Learning was scaling its platform and expanding course offerings, placing increasing demands on frontend architecture, usability, and cross-team coordination."
        },
        {
          "title": "Responsibilities",
          "content": "• Structured large, jQuery-based codebases for maintainability and reuse<br/>• Implemented responsive layouts at a time when mobile-first design was still emerging<br/>• Built interactive learning flows supporting assessments, progress tracking, and course navigation<br/>• Implemented accessible UI patterns and semantic markup<br/>• Ensured keyboard navigation and screen-reader compatibility<br/>• Aligned frontend behavior with evolving accessibility standards<br/>• Collaborated closely with backend and product teams to balance performance with usability"
        }
      ],
      "links": {
        "live": "https://www.sophia.org/",
        "github": ""
      },
      "tech_stack": ["JavaScript", "jQuery", "Ruby on Rails", "CSS", "HTML", "MySQL"],
      "role": "Full-Stack / Frontend Engineer",
      "date": "Jan 2011 - Dec 2013",
      "location": "Minsk, Belarus (remote for Minneapolis-based company)",
      "team_size": "~25-person cross-functional team",
      "company": "Sophia Learning (via Warecorp)",
      "company_size": "100+ employees",
      "image": "/images/sophia-project.jpg",
      "achievements": [
        "Platform achieved ADA compliance certification",
        "Made responsive design a foundational standard",
        "Delivered high-traffic interfaces with performance, accessibility, and usability as first-class concerns"
      ]
    },
    {
      "id": 6,
      "name": "KL82 Commercial Web Projects",
      "short_descr": "Boutique digital studio delivering custom commercial web projects, interactive experiences, and early CMS-based platforms for local and regional clients.",
      "long_descr": [
        {
          "content": "Creative Laboratory 82 (KL82) was a Minsk-based digital production studio focused on end-to-end delivery of commercial web projects. The studio worked with local and regional clients across industries, building marketing sites, e-commerce platforms, and interactive experiences during the early evolution of modern web development. Projects were delivered by small, fast-moving teams, requiring engineers to operate across the full stack — from UI and backend logic to deployment and server configuration."
        },
        {
          "title": "Responsibilities",
          "content": "• Delivered commercial web applications across frontend and backend<br/>• Built modular JavaScript interfaces and backend features<br/>• Developed multi-brand UI systems with accessibility foundations<br/>• Built custom UIs with hand-written HTML, CSS, and JavaScript<br/>• Developed and extended CMS platforms (WordPress, Joomla, Drupal)<br/>• Implemented e-commerce functionality and data-driven pages<br/>• Configured servers and deployments (Apache-based environments)<br/>• Built Flash-based interactive marketing experiences and games with ActionScript"
        }
      ],
      "links": {
        "live": "",
        "github": ""
      },
      "tech_stack": ["PHP", "MySQL", "JavaScript", "jQuery", "HTML", "CSS", "ActionScript", "WordPress", "Joomla", "Drupal"],
      "role": "Full-Stack Engineer",
      "date": "Jul 2009 - Dec 2011",
      "location": "Minsk, Belarus (on-site)",
      "team_size": "10-15 employees",
      "company": "KL82 (Creative Laboratory 82)",
      "company_size": "10-15 employees",
      "image": "/images/kl82-project.jpg",
      "achievements": [
        "Shipped 20+ commercial web applications end-to-end",
        "Built reusable UI components and interactive marketing experiences",
        "Helped evolve and maintain internal CMS used across client projects"
      ]
    }
  ]
}
