{
  "work": [
    {
      "position": "Staff Frontend Engineer",
      "company": "WeTransfer",
      "start": "Sept 2022",
      "end": "Sept 2024",
      "desc": "Owned frontend platform architecture across multiple high-traffic products, focusing on shared UI foundations, developer experience, and long-term scalability. Operated at Staff level across product and platform teams while remaining hands-on in architecture and implementation.",
      "location": "NYC (remote)",
      "team_size": "App Platform team",
      "addon": "4 years total at WeTransfer",
      "responsibilities": [
        "Led frontend platform architecture, including a multi-package design system and shared UI foundations",
        "Designed and implemented CI/CD pipelines, build systems, and publishing workflows",
        "Partnered with product, design, and engineering leadership to translate product vision into cross-team execution"
      ],
      "achievements": [
        "Founding frontend engineer on the App Platform team, enabling UI reuse across five product teams",
        "Designed a scalable UI foundation adopted by 30+ frontend engineers",
        "Reduced code duplication and improved consistency across frontend codebases organization-wide",
        "Contributed to interviewing, onboarding, and defining platform standards and best practices"
      ],
      "link": "https://wetransfer.com"
    },
    {
      "position": "Senior Full-Stack Engineer",
      "company": "WeTransfer",
      "start": "Sept 2020",
      "end": "Dec 2022",
      "desc": "Worked on a visually rich, real-time collaborative product used at scale, owning complex frontend systems while contributing across the stack. Focused on performance, maintainability, and high-quality user interaction in a fast-moving product environment.",
      "location": "NYC (remote)",
      "team_size": "Paste team",
      "addon": "",
      "responsibilities": [
        "Modernized frontend architecture to improve performance, maintainability, and scalability",
        "Built and evolved complex real-time collaborative editing features",
        "Owned end-to-end feature delivery from scoping through release",
        "Improved interactive user experience for simultaneous editing"
      ],
      "achievements": [
        "Scaled graphically rich products (Paste, Portals, Transfer) using modular, high-performance frontend architecture",
        "Translated product initiatives into clearly scoped technical plans and delivery milestones",
        "Delivered cross-stack features (~70% frontend / 30% backend) aligned with roadmap goals",
        "Led refactoring efforts and enforced coding standards to improve long-term maintainability"
      ],
      "link": "https://wetransfer.com"
    },
    {
      "position": "Senior Full-Stack Engineer",
      "company": "Namely",
      "start": "Sept 2019",
      "end": "Sept 2020",
      "desc": "Helped build and scale a greenfield integrations product in a data-heavy, regulated HR domain, bridging frontend architecture and backend APIs. Owned complex workflows for data import, validation, and reconciliation.",
      "location": "NYC (hybrid)",
      "team_size": "Integration team",
      "addon": "2 years total at Namely",
      "responsibilities": [
        "Contributed to Go-based REST APIs",
        "Owned integration tool end-to-end from UX to API delivery",
        "Mentored engineers through code reviews, POCs, and design docs"
      ],
      "achievements": [
        "Transitioned into full-stack role to accelerate delivery of a newly launched integrations product",
        "Built and extended backend services: API endpoints, validation logic, enrollment workflows",
        "Onboarded and mentored multiple frontend engineers",
        "Improved cross-team communication by bridging frontend and backend constraints",
        "Ensured scalability as more data types, clients, and edge cases were introduced"
      ],
      "link": "https://www.namely.com/platform/"
    },
    {
      "position": "Senior Frontend Engineer",
      "company": "Namely",
      "start": "Sept 2018",
      "end": "Sept 2019",
      "desc": "Worked as part of a centralized frontend discipline, scaling shared UI foundations and design systems across multiple HR, payroll, and benefits products. Focused on performance, consistency, and complex data-driven workflows.",
      "location": "NYC (hybrid)",
      "team_size": "FE Core team",
      "addon": "",
      "responsibilities": [
        "Scaled HR platform capabilities through new tools and product integrations",
        "Owned product-critical modules with focus on performance and scalability",
        "Built and documented a shared design system",
        "Delivered React-based UIs for complex HR and payroll onboarding workflows"
      ],
      "achievements": [
        "Sole frontend engineer for a multi-step employee data integration product built from scratch",
        "Led UI architecture for validating complex HR & payroll data from multiple sources",
        "Collaborated closely with design, PMs, and backend teams to ship iterative releases",
        "Helped evolve the core design system across HR, Payroll, Benefits, and Integrations",
        "Improved frontend reuse and consistency across the organization"
      ],
      "link": "https://www.namely.com/platform/"
    },
    {
      "position": "Software Engineer",
      "company": "AI Amelia (IPsoft)",
      "start": "September 2017",
      "end": "September 2018",
      "desc": "Built enterprise-grade frontend systems for configuring conversational AI workflows, translating complex dialog logic into usable interfaces for non-technical users. Operated at the intersection of frontend engineering and applied AI systems.",
      "location": "New York (on-site)",
      "team_size": "UX Team",
      "addon": "1 year",
      "responsibilities": [
        "Built React-based conversational UI for enterprise customers",
        "Collaborated with Cognitive Engineers to design dialog configuration workflows",
        "Developed frontend architecture supporting branding and multi-tenant deployments"
      ],
      "achievements": [
        "Implemented accessible UI patterns including keyboard and assistive-technology support",
        "Designed BPMN-inspired UI components for visual dialog configuration",
        "Supported enterprise deployments, contributing to adoption across 20+ clients"
      ],
      "link": "https://amelia.ai"
    },
    {
      "position": "Freelance Engineer",
      "company": "U.S. Relocation & Freelance",
      "start": "2015",
      "end": "2017",
      "desc": "U.S. relocation & freelance engineering (Angular, Vue, MVPs)",
      "location": "U.S.",
      "team_size": "",
      "addon": "",
      "responsibilities": [
        "Built MVPs and web applications using Angular and Vue.js",
        "Delivered freelance engineering projects during U.S. relocation period"
      ],
      "achievements": "",
      "link": ""
    },
    {
      "position": "Technical Lead / Senior Frontend Engineer",
      "company": "Candena",
      "start": "Dec 2013",
      "end": "Dec 2015",
      "desc": "Owned frontend architecture and modernization for a B2B EdTech platform, evolving a legacy Rails application into a configurable, white-label system. Led frontend direction while continuing hands-on development.",
      "location": "Berlin (remote)",
      "team_size": "5-person team",
      "addon": "3 years",
      "responsibilities": [
        "Led frontend modernization of a legacy Rails application",
        "Delivered modular SPA frontends while maintaining the legacy system",
        "Introduced greenfield React application for new workflows",
        "Established frontend standards, CI pipelines, and workflows",
        "Acted as technical lead supporting hiring, onboarding, and planning"
      ],
      "achievements": [
        "Designed a fully themeable UI system enabling white-label deployments",
        "Defined frontend architecture and API integration patterns improving scalability",
        "Improved delivery quality across a distributed team through documentation and reviews"
      ],
      "link": "https://candena.digital"
    },
    {
      "position": "Early Full-Stack / Frontend Engineer",
      "company": "Various (Europe)",
      "start": "2008",
      "end": "2012",
      "desc": "Built commercial web products end-to-end in small teams, gaining foundational experience across frontend, backend, data modeling, and deployment. Developed strong ownership habits and pragmatic engineering judgment early in career.",
      "location": "Europe (on-site / remote)",
      "team_size": "10-15 employees",
      "addon": "",
      "responsibilities": [
        "Delivered commercial web applications across frontend and backend",
        "Built modular JavaScript interfaces and backend features",
        "Developed multi-brand UI systems with accessibility foundations"
      ],
      "achievements": [
        "Delivered 20+ commercial web applications end-to-end",
        "Built custom CMS platforms and interactive Flash experiences",
        "Shipped products from concept through production in fast-moving teams"
      ],
      "link": ""
    }
  ]
}
